In [2]:
import numpy as np

In [3]:
import pandas as pd

In [10]:
movies_df = pd.read_csv('dataset/movies.csv')

In [11]:
ratings_df = pd.read_csv('dataset/ratings.csv')

In [12]:
movies_df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [13]:
movies_df['year'] = movies_df.title.str.extract('(\(\d\d\d\d\))',expand=False)
movies_df['year']

0        (1995)
1        (1995)
2        (1995)
3        (1995)
4        (1995)
          ...
27273    (2007)
27274    (2002)
27275    (2014)
27276    (2001)
27277    (2014)
Name: year, Length: 27278, dtype: object

In [14]:
#Removing paranthesis
movies_df['year'] = movies_df.year.str.extract('(\d\d\d\d)',expand=False)
movies_df['year']

0        1995
1        1995
2        1995
3        1995
4        1995
         ...
27273    2007
27274    2002
27275    2014
27276    2001
27277    2014
Name: year, Length: 27278, dtype: object

In [15]:
movies_df['title']

0                          Toy Story (1995)
1                            Jumanji (1995)
2                   Grumpier Old Men (1995)
3                  Waiting to Exhale (1995)
4        Father of the Bride Part II (1995)
                        ...
27273          Kein Bund für's Leben (2007)
27274         Feuer, Eis & Dosenbier (2002)
27275                    The Pirates (2014)
27276                   Rentun Ruusu (2001)
27277                      Innocence (2014)
Name: title, Length: 27278, dtype: object

In [16]:
#Removing the years from the 'title' column
movies_df['title'] = movies_df.title.str.replace('(\(\d\d\d\d\))', '')
movies_df['title']

C:\Users\GH\AppData\Local\Temp\ipykernel_11780\2532954281.py:2: FutureWarning: The default value of regex will change from True to False in a future version.
  movies_df['title'] = movies_df.title.str.replace('(\(\d\d\d\d\))', '')

0                          Toy Story
1                            Jumanji
2                   Grumpier Old Men
3                  Waiting to Exhale
4        Father of the Bride Part II
                     ...
27273          Kein Bund für's Leben
27274         Feuer, Eis & Dosenbier
27275                    The Pirates
27276                   Rentun Ruusu
27277                      Innocence
Name: title, Length: 27278, dtype: object

In [17]:
#Applying the strip function to get rid of any ending whitespace characters that may have appeared
movies_df['title'] = movies_df['title'].apply(lambda x: x.strip())

In [18]:
movies_df.head()

,movieId,title,genres,year
0,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995
1,2,Jumanji,Adventure|Children|Fantasy,1995
2,3,Grumpier Old Men,Comedy|Romance,1995
3,4,Waiting to Exhale,Comedy|Drama|Romance,1995
4,5,Father of the Bride Part II,Comedy,1995

In [19]:
movies_df = movies_df.drop('genres', 1)
movies_df.head()

C:\Users\GH\AppData\Local\Temp\ipykernel_11780\1727178456.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  movies_df = movies_df.drop('genres', 1)

   movieId                        title  year
0        1                    Toy Story  1995
1        2                      Jumanji  1995
2        3             Grumpier Old Men  1995
3        4            Waiting to Exhale  1995
4        5  Father of the Bride Part II  1995

In [20]:
ratings_df.head()

   userId  movieId  rating   timestamp
0       1        2     3.5  1112486027
1       1       29     3.5  1112484676
2       1       32     3.5  1112484819
3       1       47     3.5  1112484727
4       1       50     3.5  1112484580

In [21]:
ratings_df = ratings_df.drop('timestamp', 1)
ratings_df.head()

C:\Users\GH\AppData\Local\Temp\ipykernel_11780\3809009477.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  ratings_df = ratings_df.drop('timestamp', 1)

   userId  movieId  rating
0       1        2     3.5
1       1       29     3.5
2       1       32     3.5
3       1       47     3.5
4       1       50     3.5

In [22]:
userInput = [
            {'title':'Breakfast Club, The', 'rating':5},
            {'title':'Toy Story', 'rating':3.5},
            {'title':'Jumanji', 'rating':2},
            {'title':"Pulp Fiction", 'rating':5},
            {'title':'Akira', 'rating':4.5}
         ] 
inputMovies = pd.DataFrame(userInput)
inputMovies

                 title  rating
0  Breakfast Club, The     5.0
1            Toy Story     3.5
2              Jumanji     2.0
3         Pulp Fiction     5.0
4                Akira     4.5

In [23]:
#Filtering out the movies by title
inputId = movies_df[movies_df['title'].isin(inputMovies['title'].tolist())]

#Then merging it so we can get the movieId. It's implicitly merging it by title.
inputMovies = pd.merge(inputId, inputMovies)

#Dropping information we won't use from the input dataframe
inputMovies = inputMovies.drop('year', 1)

inputMovies

C:\Users\GH\AppData\Local\Temp\ipykernel_11780\937656531.py:8: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  inputMovies = inputMovies.drop('year', 1)

   movieId                title  rating
0        1            Toy Story     3.5
1        2              Jumanji     2.0
2      296         Pulp Fiction     5.0
3     1274                Akira     4.5
4     1968  Breakfast Club, The     5.0

In [24]:
#Filtering out users that have watched movies that the input has watched and storing it
userSubset = ratings_df[ratings_df['movieId'].isin(inputMovies['movieId'].tolist())]
userSubset.head()

     userId  movieId  rating
0         1        2     3.5
11        1      296     4.0
236       3        1     4.0
451       5        2     3.0
517       6        1     5.0

In [25]:
#Groupby creates several sub dataframes where they all have the same value in the column specified as the parameter
userSubsetGroup = userSubset.groupby(['userId'])

In [26]:
userSubsetGroup.get_group(1130)

        userId  movieId  rating
166633    1130     1968     4.0

In [27]:
#user with id 1130 having all 5 similar movies watched
len(userSubsetGroup.get_group(1130))

1

In [28]:
userSubsetGroup.get_group(110)

       userId  movieId  rating
12823     110      296     0.5

In [29]:
#user with id 110 having only 1 similar movie watched
len(userSubsetGroup.get_group(110))

1

In [30]:
#Sorting it so users with movie most in common with the input will have priority
userSubsetGroup = sorted(userSubsetGroup,  key=lambda x: len(x[1]), reverse=True)

In [32]:
#Top most user with id 75 having all 5 similar moves watched
userSubsetGroup[0]

(91,
       userId  movieId  rating
 9621      91        1     4.0
 9622      91        2     3.5
 9669      91      296     3.5
 9826      91     1274     2.5
 9903      91     1968     4.0)

In [33]:
#name of top user group
userSubsetGroup[0][0]

91

In [34]:
#dataframe of top user group
userSubsetGroup[0][1]

      userId  movieId  rating
9621      91        1     4.0
9622      91        2     3.5
9669      91      296     3.5
9826      91     1274     2.5
9903      91     1968     4.0

In [35]:
userSubsetGroup = userSubsetGroup[0:100]

In [36]:
#Store the Pearson Correlation in a dictionary, where the key is the user Id and the value is the coefficient
pearsonCorrelationDict = {}

#For every user group in our subset
for name, group in userSubsetGroup:
    
    #Let's start by sorting the input and current user group so the values aren't mixed up later on
    group = group.sort_values(by='movieId')
    inputMovies = inputMovies.sort_values(by='movieId')
    
    #Get the N (total similar movies watched) for the formula 
    nRatings = len(group)
    
    #Get the review scores for the movies that they both have in common
    temp_df = inputMovies[inputMovies['movieId'].isin(group['movieId'].tolist())]
    
    ###For Debugging Purpose
    #if nRatings<5:
    #    print(inputMovies['movieId'].isin(group['movieId'].tolist()))
    #    break
    #else:
    #    continue
    
    #And then store them in a temporary buffer variable in a list format to facilitate future calculations
    tempRatingList = temp_df['rating'].tolist()
    
    #Let's also put the current user group reviews in a list format
    tempGroupList = group['rating'].tolist()
    
    #Now let's calculate the pearson correlation between two users, so called, x and y

    #For package based
    #scipy.stats import pearsonr
    #pearsonr(tempRatingList,tempGroupList)[0]

    #For hard code based
    Sxx = sum([i**2 for i in tempRatingList]) - pow(sum(tempRatingList),2)/float(nRatings)
    Syy = sum([i**2 for i in tempGroupList]) - pow(sum(tempGroupList),2)/float(nRatings)
    Sxy = sum( i*j for i, j in zip(tempRatingList, tempGroupList)) - sum(tempRatingList)*sum(tempGroupList)/float(nRatings)
    
    #If the denominator is different than zero, then divide, else, 0 correlation.
    if Sxx != 0 and Syy != 0:
        pearsonCorrelationDict[name] = Sxy/np.sqrt(Sxx*Syy)
    else:
        pearsonCorrelationDict[name] = 0

In [37]:
pearsonCorrelationDict.items()

dict_items([(91, -0.08006407690254357), (294, 0.4385290096535115), (586, 0.5393193716300061), (648, 0.6880209161537812), (775, 0.8362420100070908), (812, 0.6016568375961869), (869, 0.1860521018838127), (903, -0.17902871850985827), (1200, 0.5370861555295743), (1244, 0.10963225241337883), (1715, 0.8951435925492911), (1748, 0.8320502943378437), (1763, -0.268543077764787), (1810, 0.8594395636904102), (1813, 0.8347371386380908), (1849, 0.626600514784503), (1864, 0.8320502943378437), (1942, 0.774023530673004), (1984, -0.31803907173309875), (2047, 0.8976095575314932), (2099, -0.4385290096535115), (2367, 0.49334513586020373), (2397, 0), (2515, 0.8951435925492914), (2661, 0.4385290096535153), (2757, 0.7844645405527362), (2959, 0.11720180773462363), (2988, 0.7197795937681559), (3179, 0.29417420270727607), (3218, 0.8503864129218268), (3268, 0.8204126541423654), (3269, 0.8648817040445187), (3318, 0.8790135580096794), (3397, 0.711233325153824), (3487, 0.36544084137792915), (3576, 0.5967623950328603), (3629, 0.8807048459279793), (3858, 0.4772135722318333), (3986, 0.6864064729836442), (4034, 0.657793514480273), (4332, 0.35805743701971815), (4358, 0.1386750490563073), (4529, 0.5765566601970551), (4598, 0.358057437019716), (4696, 0.6577935144802716), (5504, -0.43852900965351443), (5518, 0.7205766921228921), (5576, 0.8807048459279793), (5706, 0.7205766921228921), (5791, 0.4385290096535153), (5825, 0.8600261451922278), (6057, 0.537086155529574), (6207, 0.5860090386731196), (6233, -0.11720180773462363), (6369, 0.657793514480273), (6630, 0.4385290096535145), (6743, 0.8594395636904102), (6976, 0.06296909605425952), (6978, 0.43852900965351443), (7083, 0.3440104580768906), (54, 0.45454545454545453), (116, 0.4788611546444422), (137, 0.8528028654224418), (140, 0.47140452079103173), (156, -0.5222329678670935), (220, 0.4364357804719848), (232, 0.7590721152765897), (271, 0.4264014327112209), (298, 0.8703882797784892), (347, 0.9847319278346618), (359, -0.408248290463863), (367, 0.9943342320224882), (370, 1.0), (388, 0.7425282823862206), (413, -0.3273268353539886), (425, 0.6363636363636364), (427, 0.8703882797784892), (440, 0.8510644963469901), (462, 0.5855400437691199), (473, 0.6363636363636364), (546, 0.8043996665398437), (614, 0.0), (649, 0.9669875568304563), (717, -0.27701734442577747), (729, 0.9827076298239908), (741, 0.7816608327818948), (809, -0.17407765595569782), (872, 0), (892, -0.4082482904638631), (916, 0.8528028654224418), (932, -0.51425947722658), (936, 0.0), (949, -0.4573295603800236), (955, 0.09090909090909091), (970, 0.7385489458759964), (982, 0.8703882797784892), (987, 0.8703882797784892), (1001, 0.4264014327112209), (1073, 0.8703882797784892), (1085, 0.8703882797784892)])

In [38]:
pearsonDF = pd.DataFrame.from_dict(pearsonCorrelationDict, orient='index')
pearsonDF.head()

            0
91  -0.080064
294  0.438529
586  0.539319
648  0.688021
775  0.836242

In [39]:
pearsonDF.columns = ['similarityIndex']
pearsonDF['userId'] = pearsonDF.index
pearsonDF.index = range(len(pearsonDF))
pearsonDF.head()

   similarityIndex  userId
0        -0.080064      91
1         0.438529     294
2         0.539319     586
3         0.688021     648
4         0.836242     775

In [40]:
topUsers=pearsonDF.sort_values(by='similarityIndex', ascending=False)[0:50]
topUsers.head()

    similarityIndex  userId
72         1.000000     370
71         0.994334     367
69         0.984732     347
84         0.982708     729
82         0.966988     649

In [41]:
topUsersRating = topUsers.merge(ratings_df, left_on='userId', right_on='userId', how='inner')
topUsersRating.head()

   similarityIndex  userId  movieId  rating
0              1.0     370        1     4.5
1              1.0     370        2     4.0
2              1.0     370        6     5.0
3              1.0     370       25     4.5
4              1.0     370       32     5.0

In [42]:
#Multiplies the similarity by the user's ratings
topUsersRating['weightedRating'] = topUsersRating['similarityIndex']*topUsersRating['rating']
topUsersRating.head()

   similarityIndex  userId  movieId  rating  weightedRating
0              1.0     370        1     4.5             4.5
1              1.0     370        2     4.0             4.0
2              1.0     370        6     5.0             5.0
3              1.0     370       25     4.5             4.5
4              1.0     370       32     5.0             5.0

In [43]:
#Applies a sum to the topUsers after grouping it up by userId
tempTopUsersRating = topUsersRating.groupby('movieId').sum()[['similarityIndex','weightedRating']]
tempTopUsersRating.columns = ['sum_similarityIndex','sum_weightedRating']
tempTopUsersRating.head()

         sum_similarityIndex  sum_weightedRating
movieId
1                  40.591404          157.603452
2                  40.591404          103.356759
3                  12.756862           36.674474
4                   4.456489           11.067262
5                   9.762143           26.597078

In [44]:
#Creates an empty dataframe
recommendation_df = pd.DataFrame()
#Now we take the weighted average
recommendation_df['weighted average recommendation score'] = tempTopUsersRating['sum_weightedRating']/tempTopUsersRating['sum_similarityIndex']
recommendation_df['movieId'] = tempTopUsersRating.index
recommendation_df.head()

         weighted average recommendation score  movieId
movieId
1                                     3.882681        1
2                                     2.546272        2
3                                     2.874882        3
4                                     2.483404        4
5                                     2.724512        5

In [45]:
recommendation_df = recommendation_df.sort_values(by='weighted average recommendation score', ascending=False)
recommendation_df.head()

         weighted average recommendation score  movieId
movieId
2649                                       5.0     2649
4185                                       5.0     4185
8499                                       5.0     8499
6356                                       5.0     6356
7057                                       5.0     7057

In [46]:
#Recommended Movies
movies_df.loc[movies_df['movieId'].isin(recommendation_df.head(20)['movieId'].tolist())]

      movieId                                              title  year
879       896                  Wild Reeds (Les roseaux sauvages)  1994
1716     1788                                      Men with Guns  1997
1748     1829                                        Chinese Box  1997
2563     2649                                Son of Frankenstein  1939
3003     3090                                            Matewan  1987
3050     3137                                    Sea Wolves, The  1980
3067     3154                                   Blood on the Sun  1945
3074     3161                                             Onegin  1999
4091     4185                        Elvis: That's the Way It Is  1970
5727     5826                                         Rio Grande  1950
6257     6356                        Gunfight at the O.K. Corral  1957
6945     7057                         Midsummer Night's Dream, A  1935
7044     7156  Fog of War: Eleven Lessons from the Life of Ro...  2003
7084     7196                                           Men, The  1950
7852     8499                                        Pretty Baby  1978
8010     8693                                   What Price Glory  1952
8017     8700                                  Destination Tokyo  1943
8989    26693                                                 It  1990
9161    27002                         From the Earth to the Moon  1998
9567    30701       Chimes at Midnight (Campanadas a medianoche)  1965